fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированныхПремий/ВКМ_НачислениеФиксированныхПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированныхПремий</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПремияНачисленная</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПроцентПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_НачислениеФиксированныхПремий/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	СформироватьДвиженияДополнительныеНачиления();

	СформироватьДвиженияУдержания();

	СформироватьДвиженияВзаиморасчетыССотрудниками();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияДополнительныеНачиления()

	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;

	Для Каждого Строка Из ПремияНачисленная Цикл

		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		Движение.Результат = Строка.СуммаПремии;

	КонецЦикла;

	Движения.ВКМ_ДополнительныеНачисления.Записать();
КонецПроцедуры

Процедура СформироватьДвиженияУдержания()
	
	Движения.ВКМ_Удержания.Записывать = Истина;

	Для Каждого Строка Из ПремияНачисленная Цикл

		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		Движение.Результат = Строка.СуммаПремии * 13 / 100;

	КонецЦикла;

	Движения.ВКМ_Удержания.Записать();
КонецПроцедуры

Процедура СформироватьДвиженияВзаиморасчетыССотрудниками() 
	
	// регистр ВзаиморасчетыССотрудниками
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	ВКМ_НачислениеФиксированныхПремийПремияНачисленная.Сотрудник КАК Сотрудник,
				   |	СУММА(ВКМ_НачислениеФиксированныхПремийПремияНачисленная.СуммаПремии) КАК СуммаПремии
				   |ИЗ
				   |	Документ.ВКМ_НачислениеФиксированныхПремий.ПремияНачисленная КАК ВКМ_НачислениеФиксированныхПремийПремияНачисленная
				   |ГДЕ
				   |	ВКМ_НачислениеФиксированныхПремийПремияНачисленная.Ссылка = &Ссылка
				   |СГРУППИРОВАТЬ ПО
				   |	ВКМ_НачислениеФиксированныхПремийПремияНачисленная.Сотрудник";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
		СуммаУдержания = Выборка.СуммаПремии * 13 / 100;
		Движение.Сумма = Выборка.СуммаПремии - СуммаУдержания;

	КонецЦикла;

КонецПроцедуры
#КонецОбласти

#КонецЕсли
